

int main(){
   int x = 8;
}


/*
Что такое переменная?
Что такое стековый фрейм?



push rbp                   ; Сохраняем старый указатель стека
mov rbp, rsp               ; Создаём новый стековый кадр
mov DWORD PTR [rbp-4], 8   ; Кладём число 8 в переменную x
mov eax, 0                 ; Возвращаем 0 (return 0 по умолчанию)
pop rbp                    ; Восстанавливаем старый указатель стека
ret                        ; Выходим из функции


; 1. Сначала делаем стековый кадр для нашей функции
; 2. Выделяем 4 байта под int x и пихаем туда 8
; 3. Возвращаем 0 как положено
; 4. Прибираем за собой стек
; BYTE -> 1 байт
; WORD -> 2 байта
; DWORD -> 4 байта
; QWORD -> 8 байт
; TBYTE -> 10 байт
*/
