

int main(){
    int i = 0;
    while(i < 3){
        i += 1;
    }

}


/*

push rbp                    ; Сохраняем указатель
mov rbp, rsp                ; Новый кадр
mov DWORD PTR [rbp-4], 0    ; i = 0
jmp .L2                     ; Прыгаем на проверку условия
.L3:                        ; Начало тела цикла
    add DWORD PTR [rbp-4], 1    ; i += 1
.L2:                        ; Метка проверки условия
    cmp DWORD PTR [rbp-4], 2    ; Сравниваем i с 2
    jle .L3                     ; Если i <= 2, продолжаем цикл
    mov eax, 0                  ; Возвращаем 0
    pop rbp                     ; Восстанавливаем стек
    ret                         ; Домой!


; Цикл while компилируется в:
; 1. Безусловный прыжок на проверку
; 2. Тело цикла
; 3. Проверку условия
; 4. Условный прыжок назад в тело 
; Условие i < 3 оптимизируется в i <= 2

*/